<?php

declare(strict_types=1);

return [
    'title' => 'Χρήστες',
    'index_page_title' => 'Όλοι οι Χρήστες',
    'tabs' => [
        'admins' => 'Διαχειριστές',
        'managers' => 'Υπεύθυνοι Επισημειωτών',
        'annotators' => 'Επισημειωτές',
    ],
    'actions' => [
        'new' => 'Νέος Χρήστης',
        'new_big_button' => 'Δημιουργία Χρήστη',
        'edit_big_button' => 'Επεξεργασία Χρήστη',
        'create' => 'Δημιουργία Χρήστη',
        'edit' => 'Επεξεργασία Χρήστη',
        'update' => 'Ενημέρωση Χρήστη',
        'delete' => 'Διαγραφή Χρήστη',
        'show' => 'Προβολή Χρήστη',
        'restore' => 'Επαναφορά Χρήστη',
        'view_edit' => 'Προβολή/Επεξεργασία',
        'view' => 'Προβολή',
        'create_manager' => 'Δημιουργία νέου Υπευθύνου Επισημειωτών',
        'create_admin' => 'Δημιουργία νέου Διαχειριστή',
        'create_annotator' => 'Δημιουργία νέου Επισημειωτή',
    ],
    'labels' => [
        'name' => 'Όνομα',
        'username_name' => 'Όνομα χρήστη/Όνομα',
        'username' => 'Όνομα Χρήστη',
        'email' => 'Email',
        'password' => 'Κωδικός',
        'password_confirmation' => 'Επιβεβαίωση Κωδικού',
        'actions' => 'Ενέργειες',
        'role' => 'Ρόλος',
        'status' => 'Κατάσταση',
        'created_at' => 'Ημερομηνία Δημιουργίας',
    ],
    'filters' => [
        'show_active' => 'Εμφάνιση Ενεργών',
        'show_all' => 'Εμφάνιση όλων',
        'show_only_active' => 'Μόνο ενεργοί',
        'show_only_inactive' => 'Μόνο ανενεργοί',
        'show_only_mine' => 'Εμφάνιση Μόνο Υπευθύνων Επισημειωτών με τους οποίους είμαι συνδεδεμένος',
        'show_only_mine_annotators' => 'Εμφάνιση Μόνο Επισημειωτών με τους οποίους είμαι συνδεδεμένος',
    ],
    'placeholders' => [
        'select_role' => 'Επιλέξτε Ρόλο',
        'search' => 'Αναζήτηση με όνομα ή email...',
    ],
    'messages' => [
        'created' => 'Ο χρήστης δημιουργήθηκε με επιτυχία',
        'updated' => 'Ο χρήστης ενημερώθηκε με επιτυχία',
        'deleted' => 'Ο χρήστης διαγράφηκε με επιτυχία',
        'restored' => 'Ο χρήστης επαναφέρθηκε με επιτυχία',
    ],
    'delete' => [
        'title' => 'Διαγραφή Χρήστη',
        'description' => 'Είστε σίγουροι ότι θέλετε να διαγράψετε αυτόν τον χρήστη;',
    ],
    'status' => [
        'active' => 'Ενεργός',
        'inactive' => 'Ανενεργός',
    ],
    'restore' => [
        'title' => 'Επαναφορά Χρήστη',
        'description' => 'Είστε σίγουροι ότι θέλετε να επαναφέρετε αυτόν τον χρήστη;',
    ],
];
